In [22]:
import pandas as pd 
import numpy as np
from sklearn import preprocessing
from sklearn.cluster import estimate_bandwidth
from sklearn.cluster import MeanShift

In [62]:
laptop_data = pd.read_csv('laptops.csv')
laptop_data.columns = ["name", "price"]
laptop_data.head()

                                                name  price
0  Apple MacBook Pro M1 2020 13" 8 GB RAM & 256 G...  10622
1  Samsung Galaxy Book Pro 360 - Intel Core i7 & ...  11999
2  ASUS ROG Strix G17 G713QM-HX015T - RTX3060 & R...  11999
3  Lenovo Legion 5 Pro 16ACH6H - RTX3070 & Ryzen ...  12499
4  MSI Summit E13 Flip Evo - Intel Core i7 1185G7...  14546

In [63]:
label_enc =preprocessing.LabelEncoder()
laptop_data['name'] = label_enc.fit_transform(laptop_data['name'].astype(str))
laptop_data.head()

   name  price
0   315  10622
1   791  11999
2    42  11999
3   552  12499
4   693  14546

In [64]:
est_bandwidth = estimate_bandwidth(laptop_data)
print(est_bandwidth)

4015.32229866256

In [65]:
analyzer = MeanShift(bandwidth=3000) 
analyzer.fit(laptop_data)

MeanShift(bandwidth=3000, bin_seeding=False, cluster_all=True, max_iter=300,
          min_bin_freq=1, n_jobs=None, seeds=None)

In [66]:
labels = analyzer.labels_
print(labels)
print('\n\n',np.unique(labels))

[0 0 0 ... 0 0 0]


 [0 1 2 3 4 5]

In [67]:
laptop_data['cluster_group'] = np.nan
for i in range(len(laptop_data)): # loop 714 rows
    laptop_data.iloc[i,laptop_data.columns.get_loc('cluster_group')] = labels[i] #set the cluster label on each row

laptop_data.head()

   name  price  cluster_group
0   315  10622            0.0
1   791  11999            0.0
2    42  11999            0.0
3   552  12499            0.0
4   693  14546            0.0

In [68]:
laptop_data.describe()

              name         price  cluster_group
count  1237.000000   1237.000000    1237.000000
mean    441.308003  11736.928860       0.226354
std     213.039879   6833.333824       0.501310
min       0.000000   1533.000000       0.000000
25%     293.000000   6768.000000       0.000000
50%     449.000000  10504.000000       0.000000
75%     609.000000  15155.000000       0.000000
max     793.000000  64146.000000       5.000000

In [69]:
#Grouping laptops by Cluster
laptop_cluster_data = laptop_data.groupby(['cluster_group']).mean()
#Count of laptops in each cluster
laptop_cluster_data['Counts'] = pd.Series(laptop_data.groupby(['cluster_group']).size())
laptop_cluster_data

                     name         price  Counts
cluster_group
0.0            432.350151   9116.998991     991
1.0            477.719457  20742.348416     221
2.0            494.631579  32613.736842      19
3.0            354.750000  42136.250000       4
4.0            605.000000  47224.000000       1
5.0            441.000000  64146.000000       1